clackups/draftling/firmware/sdkconfig.defaults.xteink_x4_pro
# CMakePresets.json board defaults: Xteink X4 Pro
# Sets the hardware model and IDF target used by the "xteink_x4_pro" preset.

CONFIG_IDF_TARGET="esp32s3"
CONFIG_DRAFTLING_MODEL_XTEINK_X4_PRO=y
